Revit 2024 API
ImageType.WidthInPixels Property
 Number of pixels in the horizontal direction of the image
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public int WidthInPixels { get; }
Visual Basic
Public ReadOnly Property WidthInPixels As Integer
	Get
Visual C++
public:
property int WidthInPixels {
	int get ();
}
See Also
ImageType Class
Autodesk.Revit.DB Namespace